# **Trabalhando com Planilhas do Excel - Datas**
Complementado por vichShir

### Carregar dados

In [5]:
!pip install -q openpyxl

WARNING: You are using pip version 21.2.4; however, version 21.3 is available.
You should consider upgrading via the 'c:\users\victo\appdata\local\programs\python\python38-32\python.exe -m pip install --upgrade pip' command.

In [6]:
#Importando a biblioteca
import pandas as pd

In [11]:
#Leitura dos arquivos
df1 = pd.read_excel("https://github.com/vichShir/dio-cognizant-analise-dados-2021/blob/master/Dados/Aracaju.xlsx?raw=true", engine='openpyxl')
df2 = pd.read_excel("https://github.com/vichShir/dio-cognizant-analise-dados-2021/blob/master/Dados/Fortaleza.xlsx?raw=true", engine='openpyxl')
df3 = pd.read_excel("https://github.com/vichShir/dio-cognizant-analise-dados-2021/blob/master/Dados/Natal.xlsx?raw=true", engine='openpyxl')
df4 = pd.read_excel("https://github.com/vichShir/dio-cognizant-analise-dados-2021/blob/master/Dados/Recife.xlsx?raw=true", engine='openpyxl')
df5 = pd.read_excel("https://github.com/vichShir/dio-cognizant-analise-dados-2021/blob/master/Dados/Salvador.xlsx?raw=true", engine='openpyxl')

### Visualizar os DataFrames

In [13]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [14]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [15]:
df3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [16]:
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [12]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

### Tratar dados

In [17]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [18]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [19]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [20]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
76    Salvador 2019-01-01   39.51    1035     3
130  Fortaleza 2019-03-02   12.36     983     4
94    Salvador 2019-01-01   33.24    1037     1
9        Natal 2018-05-02  261.00     852     3
81     Aracaju 2018-01-01   53.41    1520     2

In [21]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [22]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [23]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

### **Tratando valores faltantes**

In [25]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [26]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [27]:
df["Vendas"].mean()

122.61180089485458

In [28]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [29]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
162      Natal 2019-01-02   23.08   1036     2
125   Salvador 2019-03-02   25.00   1037     2
143   Salvador 2019-01-02   41.18   1037     2
10   Fortaleza 2019-01-01  179.88   1002     4
28    Salvador 2019-01-01  162.34   1035     2
226   Salvador 2019-01-02   38.32   1035     2
96      Recife 2019-01-01  165.36    982     7
71      Recife 2019-01-01  138.69    983     3
128      Natal 2019-01-02   36.84   1034     1
37       Natal 2018-10-03  726.00    852     2
161   Salvador 2019-01-02    5.80   1036     1
122    Aracaju 2018-01-01   38.49   1522     4
64    Salvador 2019-01-01   37.96   1037     3
130      Natal 2019-01-02   59.78   1036     1
8      Aracaju 2019-01-01   12.16   1523     1

In [30]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [31]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [32]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [33]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

### **Criando colunas novas**

In [34]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [35]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [36]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [37]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [38]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [39]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [40]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [41]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [42]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [43]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

### **Trabalhando com datas**

In [44]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [45]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [46]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [47]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [48]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [49]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [50]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
81,Fortaleza,2019-01-01,10.68,1005,1,10.68,1.0,2019
46,Recife,2019-01-01,239.17,981,8,1913.36,8.0,2019
127,Aracaju,2018-01-01,33.12,1522,9,298.08,9.0,2018
53,Fortaleza,2019-01-01,11.48,1002,4,45.92,4.0,2019
180,Salvador,2019-01-02,116.63,1035,2,233.26,2.0,2019

In [51]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [52]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
24,Aracaju,2018-01-01,151.04,1522,6,906.24,6.0,2018,1,1
141,Fortaleza,2019-03-02,182.75,983,8,1462.00,8.0,2019,3,2
238,Salvador,2019-01-03,139.64,1035,1,139.64,1.0,2019,1,3
55,Aracaju,2018-01-01,67.23,1520,8,537.84,8.0,2018,1,1
88,Natal,2019-01-02,31.20,1036,1,31.20,1.0,2019,1,2

In [53]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [54]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [55]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
0,Recife,2019-01-01,162.61,981,1,162.61,1.0,2019,1,1,365 days
6,Fortaleza,2019-01-01,38.40,1003,4,153.60,4.0,2019,1,1,365 days
160,Salvador,2019-01-02,11.76,1034,1,11.76,1.0,2019,1,2,366 days
130,Natal,2019-01-02,59.78,1036,1,59.78,1.0,2019,1,2,366 days
130,Recife,2019-03-02,12.36,983,4,49.44,4.0,2019,3,2,425 days

In [56]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [72]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
95,Salvador,2019-01-01,5.13,1035,1,5.13,1.0,2019,1,1,365 days,1
16,Natal,2018-07-01,298.00,854,3,894.00,3.0,2018,7,1,181 days,3
80,Natal,2018-05-23,264.00,852,3,792.00,3.0,2018,5,23,142 days,2
62,Recife,2019-01-01,23.04,983,6,138.24,6.0,2019,1,1,365 days,1
122,Aracaju,2018-01-01,38.49,1522,4,153.96,4.0,2018,1,1,0 days,1

In [58]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [59]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
120,Salvador,2019-03-02,140.17,1036,2,280.34,2.0,2019,3,2,425 days,1
118,Salvador,2019-03-02,92.21,1035,2,184.42,2.0,2019,3,2,425 days,1
135,Salvador,2019-03-02,9.95,1037,3,29.85,3.0,2019,3,2,425 days,1
115,Salvador,2019-03-02,202.33,1035,2,404.66,2.0,2019,3,2,425 days,1
141,Fortaleza,2019-03-02,182.75,983,8,1462.00,8.0,2019,3,2,425 days,1
42,Natal,2019-03-02,775.00,854,2,1550.00,2.0,2019,3,2,425 days,1
132,Fortaleza,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
121,Recife,2019-03-02,41.55,981,3,124.65,3.0,2019,3,2,425 days,1
113,Fortaleza,2019-03-02,38.63,980,2,77.26,2.0,2019,3,2,425 days,1
128,Fortaleza,2019-03-02,38.70,982,4,154.80,4.0,2019,3,2,425 days,1
137,Recife,2019-03-02,51.99,983,3,155.97,3.0,2019,3,2,425 days,1
128,Recife,2019-03-02,38.70,982,4,154.80,4.0,2019,3,2,425 days,1
139,Recife,2019-03-02,141.16,980,7,988.12,7.0,2019,3,2,425 days,1
125,Fortaleza,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
125,Recife,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
7,Natal,2019-03-18,886.00,853,4,3544.00,4.0,2019,3,18,441 days,1
129,Recife,2019-03-02,35.34,982,7,247.38,7.0,2019,3,2,425 days,1
109,Salvador,2019-03-02,124.37,1035,1,124.37,1.0,2019,3,2,425 days,1
130,Recife,2019-03-02,12.36,983,4,49.44,4.0,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1